load-test.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 5      # тест на 30 секунд
      arrivalRate: 1   # 50 запитів в секунду
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            name: "User {{ $randomString }}"
            email: "user{{ $randomInt(1, 10000000) }}@test.com"